Revit 2024 API
BuiltInFailures.SplineFailures Members
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures.SplineFailures type exposes the following members.
Properties
Name | Description
CannotCreateSpline
 Can't make Spline.
ClosedSpline
 Closed or self-intersecting splines are not allowed.
See Also
BuiltInFailures.SplineFailures Class
Autodesk.Revit.DB Namespace